# PANDAS

In [437]:
import pandas as pd
import numpy as np

# Series

### Empty Series

In [438]:
series = pd.Series(dtype=object)
series

Series([], dtype: object)

### Series from nd-array

In [439]:
data = np.array(['A', 'B', 'C', 'D', 'E'])
series = pd.Series(data)
series

0    A
1    B
2    C
3    D
4    E
dtype: object

### Series from nd-array with customized indexes

In [440]:
series = pd.Series(data,index=[100, 101, 102, 103, 104])
series

100    A
101    B
102    C
103    D
104    E
dtype: object

### Series from nd-array with customized indexes

In [441]:
series = pd.Series(data, index=['a','b','c',10,20])
series

a     A
b     B
c     C
10    D
20    E
dtype: object

In [442]:
series = pd.Series(data,index=[100, 101, 102, 103, 104])
series

100    A
101    B
102    C
103    D
104    E
dtype: object

### Series from dictionary

In [443]:
dictionary = {'a': 10, 'b': 20, 'c': 30, 'd': 40}

In [444]:
series = pd.Series(dictionary)
series

a    10
b    20
c    30
d    40
dtype: int64

In [445]:
series = pd.Series(dictionary, index=['b', 'a', 'd', 'f', 20])
series

b     20.0
a     10.0
d     40.0
f      NaN
20     NaN
dtype: float64

### Series from scalar value

In [446]:
series = pd.Series(5)
series

0    5
dtype: int64

In [447]:
series = pd.Series(5,index=[1,2,3])
series

1    5
2    5
3    5
dtype: int64

# Accessing Series

In [448]:
series = pd.Series([1, 2, 3, 4, 5], index=['a', 'b', 'c', 'd', 'e'])
series

a    1
b    2
c    3
d    4
e    5
dtype: int64

### Access data from series using position (0 to length(Series)-1)

In [449]:
data = series[2]
data

3

In [450]:
data = series[:4]  # it selects indexes from 0-3 (first 4 indexes)
data

a    1
b    2
c    3
d    4
dtype: int64

In [451]:
data = series[-4:]  # it selects last 4 indexes
data

b    2
c    3
d    4
e    5
dtype: int64

In [452]:
data = series[1:3]  # it selects indexes from 1-2 (index 3 is not included)
data

b    2
c    3
dtype: int64

In [453]:
data = series[2:len(series)]  # it selects indexes from 2 to length(series)-1
data

c    3
d    4
e    5
dtype: int64

### Access data from series using indexes (default/specified)

In [454]:
data = series['d']
data

4

In [455]:
data = series[['a','d','e']]
data

a    1
d    4
e    5
dtype: int64

### Appending(Insert into) Series

In [456]:
s = pd.Series([6,7,8], index=['f', 'g', 'h'])
series = series.append(s)
series

a    1
b    2
c    3
d    4
e    5
f    6
g    7
h    8
dtype: int64

### Updating Series

In [457]:
series['b'] = 22
series

a     1
b    22
c     3
d     4
e     5
f     6
g     7
h     8
dtype: int64

In [458]:
series['a', 'c'] = [11, 33]
series

a    11
b    22
c    33
d     4
e     5
f     6
g     7
h     8
dtype: int64

In [459]:
series[3:5] = [44, 55]
series

a    11
b    22
c    33
d    44
e    55
f     6
g     7
h     8
dtype: int64

### Deleting from Series

In [460]:
series = series.drop(index=['a', 'd'])
series

b    22
c    33
e    55
f     6
g     7
h     8
dtype: int64

# Data Frame

### Empty Data Frame

In [461]:
df = pd.DataFrame()

### Data Frame using List

In [462]:
data = [['Arslan', 24], ['Waqar', 29], ['Fasi', 26], ['Ghulam Haider', 19]]
df = pd.DataFrame(data, columns=['name','age'])
df

            name  age
0         Arslan   24
1          Waqar   29
2           Fasi   26
3  Ghulam Haider   19

### Data Frame using Dictionary

In [463]:
data = {'name': ['Arslan', 'Waqar', 'Fasi', 'Ghulam Haider'], 'age': [24, 29, 26, 19]}
df = pd.DataFrame(data)
df

            name  age
0         Arslan   24
1          Waqar   29
2           Fasi   26
3  Ghulam Haider   19

### Data Frame with specific row names

In [464]:
df = pd.DataFrame(data, index=['row1','row2','row3','row4'])
df

               name  age
row1         Arslan   24
row2          Waqar   29
row3           Fasi   26
row4  Ghulam Haider   19

### Data Frame using Dictionary of Series

In [465]:
data = {
    'name': pd.Series(['Arslan', 'Danish', 'Asher', 'Babar', 'Waleed'], index=['a','b','c','d','e']),
    'cgpa': pd.Series([3.42, 2.53, 3.01, 2.93], index=['a', 'b', 'c', 'd'])
}

In [466]:
df = pd.DataFrame(data)
df

     name  cgpa
a  Arslan  3.42
b  Danish  2.53
c   Asher  3.01
d   Babar  2.93
e  Waleed   NaN

### Accessing data from Data Frame

In [467]:
# Access whole column
names = df['name']
names

a    Arslan
b    Danish
c     Asher
d     Babar
e    Waleed
Name: name, dtype: object

In [468]:
# Access particular value from selected column
names['a']

'Arslan'

In [469]:
# Access whole row
student = df.loc['a']
student

name    Arslan
cgpa      3.42
Name: a, dtype: object

In [470]:
# Access particular column value from selected row
student['cgpa']

3.42

In [471]:
# Access single row using position(0 to length(rows)-1)
student = df.iloc[2]
student

name    Asher
cgpa     3.01
Name: c, dtype: object

#### Access multiple rows using position(0 to length(rows)-1)

In [472]:
students = df.iloc[:3]  # It selects rows from 0-2. Position 3 is not included (first 3 rows)
students

     name  cgpa
a  Arslan  3.42
b  Danish  2.53
c   Asher  3.01

In [473]:
students = df.iloc[-2:]  # It selects last 2 rows
students

     name  cgpa
d   Babar  2.93
e  Waleed   NaN

In [474]:
students = df.iloc[1:4]  # It selects rows from 1-3 (index 4 is not included)
students

     name  cgpa
b  Danish  2.53
c   Asher  3.01
d   Babar  2.93

In [475]:
students = df.iloc[2:len(df)]  # It selects rows from 2 to last row
students

     name  cgpa
c   Asher  3.01
d   Babar  2.93
e  Waleed   NaN

### Insert into Data Frame

In [476]:
# Insert new column
df['roll_no'] = pd.Series(['BSEF14A513', 'BSEF14A530', 'BSEF14A526', 'BSEF14A536', 'BSEF14A548'], index=['a', 'b', 'c', 'd', 'e'])
df

     name  cgpa     roll_no
a  Arslan  3.42  BSEF14A513
b  Danish  2.53  BSEF14A530
c   Asher  3.01  BSEF14A526
d   Babar  2.93  BSEF14A536
e  Waleed   NaN  BSEF14A548

In [477]:
# Insert new row
data = {'name': 'Umer Sanii', 'cgpa': 3.1, 'roll_no': 'BSEF14A501'}
d = pd.DataFrame(data, index=['f'])
df.append(d)

         name  cgpa     roll_no
a      Arslan  3.42  BSEF14A513
b      Danish  2.53  BSEF14A530
c       Asher  3.01  BSEF14A526
d       Babar  2.93  BSEF14A536
e      Waleed   NaN  BSEF14A548
f  Umer Sanii  3.10  BSEF14A501

### Update Data Frame

In [478]:
# Update single value
cgpas = df['cgpa'].view()
cgpas['e'] = 2.7
df

     name  cgpa     roll_no
a  Arslan  3.42  BSEF14A513
b  Danish  2.53  BSEF14A530
c   Asher  3.01  BSEF14A526
d   Babar  2.93  BSEF14A536
e  Waleed  2.70  BSEF14A548

In [479]:
# Update whole column
df['name'] = ['Arslan Sherazi', 'Danish Ali', 'Asher Munee', 'Babar Ali', 'Waleed Ahmed']
df

             name  cgpa     roll_no
a  Arslan Sherazi  3.42  BSEF14A513
b      Danish Ali  2.53  BSEF14A530
c     Asher Munee  3.01  BSEF14A526
d       Babar Ali  2.93  BSEF14A536
e    Waleed Ahmed  2.70  BSEF14A548

In [480]:
# Update whole row
df.iloc[0] = ['Arslan Haider Sherazi', 3.42, 'bsef14a513']
df

                    name  cgpa     roll_no
a  Arslan Haider Sherazi  3.42  bsef14a513
b             Danish Ali  2.53  BSEF14A530
c            Asher Munee  3.01  BSEF14A526
d              Babar Ali  2.93  BSEF14A536
e           Waleed Ahmed  2.70  BSEF14A548

### Delete From Data Frame

In [481]:
# Delate row
df = df.drop('e')
df

                    name  cgpa     roll_no
a  Arslan Haider Sherazi  3.42  bsef14a513
b             Danish Ali  2.53  BSEF14A530
c            Asher Munee  3.01  BSEF14A526
d              Babar Ali  2.93  BSEF14A536

In [482]:
# Delete Column
del df['roll_no']
df

                    name  cgpa
a  Arslan Haider Sherazi  3.42
b             Danish Ali  2.53
c            Asher Munee  3.01
d              Babar Ali  2.93

# Change Data Frame Row Indices

In [483]:
data = {
    'name': ['Arslan', 'Danish', 'Babar', 'Asher', 'Waleed'],
    'age': [23, 22, 21, 22, 23],
    'degree': ['SE', 'SE', 'SE', 'SE', 'SE'],
    'cgpa': [3.42, 2.53, 2.93, 3.01, 2.7]
}

In [484]:
df = pd.DataFrame(data)

In [485]:
df = df.rename(index={0: 'row1', 1: 'row2', 4: 'row4'})  # Syntax => old_index_name : new_index_name
df

        name  age degree  cgpa
row1  Arslan   23     SE  3.42
row2  Danish   22     SE  2.53
2      Babar   21     SE  2.93
3      Asher   22     SE  3.01
row4  Waleed   23     SE  2.70

# Change Column Label of Data Frame

In [486]:
df = df.rename(columns={'degree': 'degree_name', 'cgpa': 'cgpas'})
df

        name  age degree_name  cgpas
row1  Arslan   23          SE   3.42
row2  Danish   22          SE   2.53
2      Babar   21          SE   2.93
3      Asher   22          SE   3.01
row4  Waleed   23          SE   2.70

# Iterating Data Frame

### Iterating columns of Data Frame

In [487]:
# Getting column labels only
for labels in df:
    print(labels)

name
age
degree_name
cgpas

In [488]:
# Getting columns with data as key,value pair
for label, values in df.iteritems():
    print(label)
    print(values)
    print("\n")

name
row1    Arslan
row2    Danish
2        Babar
3        Asher
row4    Waleed
Name: name, dtype: object


age
row1    23
row2    22
2       21
3       22
row4    23
Name: age, dtype: int64


degree_name
row1    SE
row2    SE
2       SE
3       SE
row4    SE
Name: degree_name, dtype: object


cgpas
row1    3.42
row2    2.53
2       2.93
3       3.01
row4    2.70
Name: cgpas, dtype: float64

In [489]:
# Getting rows indexes only
indexes = df.index.values()
indexes

TypeError: 'numpy.ndarray' object is not callable

In [490]:
# Getting rows with data as key,value pair
for index, values in df.iterrows():
    print(index)
    print(values)
    print("\n")

row1
name           Arslan
age                23
degree_name        SE
cgpas            3.42
Name: row1, dtype: object


row2
name           Danish
age                22
degree_name        SE
cgpas            2.53
Name: row2, dtype: object


2
name           Babar
age               21
degree_name       SE
cgpas           2.93
Name: 2, dtype: object


3
name           Asher
age               22
degree_name       SE
cgpas           3.01
Name: 3, dtype: object


row4
name           Waleed
age                23
degree_name        SE
cgpas             2.7
Name: row4, dtype: object

In [492]:
# Getting rows with data as tuples
for row in df.itertuples():
    print(row)
    print("\n")

Pandas(Index='row1', name='Arslan', age=23, degree_name='SE', cgpas=3.42)


Pandas(Index='row2', name='Danish', age=22, degree_name='SE', cgpas=2.53)


Pandas(Index=2, name='Babar', age=21, degree_name='SE', cgpas=2.93)


Pandas(Index=3, name='Asher', age=22, degree_name='SE', cgpas=3.01)


Pandas(Index='row4', name='Waleed', age=23, degree_name='SE', cgpas=2.7)

# Applying custom functions on Data Frame
__While applying functions column wise,row wise or element wise We can only apply functions taking a single value
and returning a single value.__

In [493]:
data = [[1, 2], [3, 4], [5, 6], [7, 8]]
df = pd.DataFrame(data, columns=['col1', 'col2'], index=['row1', 'row2', 'row3', 'row4'])

### custom functions

In [494]:
def adder(n1, n2):
    return n1+n2

In [495]:
def mul(n):
    return n*5

### Apply function on whole DataFrame

In [496]:
df = df.pipe(adder,2)  # add 2 into every element of Data Frame
df

      col1  col2
row1     3     4
row2     5     6
row3     7     8
row4     9    10

### Apply function on DataFrame column wise

In [497]:
df_column = df.apply(np.mean)  # find mean column wise
df_column

col1    6.0
col2    7.0
dtype: float64

In [498]:
df_column = df.apply(np.mean)  # find mean column wise
df_column

col1    6.0
col2    7.0
dtype: float64

In [499]:
df_column_mul = df.apply(mul)
df_column_mul

      col1  col2
row1    15    20
row2    25    30
row3    35    40
row4    45    50

### Apply function on single column of DataFrame

In [500]:
df_column_mul_single = df['col1'].apply(mul)
df_column_mul_single

row1    15
row2    25
row3    35
row4    45
Name: col1, dtype: int64

### Apply function on DataFrame row wise

In [501]:
df_row = df.apply(np.mean,axis=1)  # find mean row wise
df_row

row1    3.5
row2    5.5
row3    7.5
row4    9.5
dtype: float64

### Apply function on single row of DataFrame

In [502]:
df_row_mul_single = df.loc['row1'].apply(mul)
df_row_mul_single

col1    15
col2    20
Name: row1, dtype: int64

### Apply function element wise

In [503]:
df_mul = df.applymap(mul)
df_mul

      col1  col2
row1    15    20
row2    25    30
row3    35    40
row4    45    50

In [504]:
df_lambda = df.applymap(lambda x : x * 100)
df_lambda

      col1  col2
row1   300   400
row2   500   600
row3   700   800
row4   900  1000

# Descriptive Statistics

__Available statistics functions__
* count()
* sum()
* mean()
* median()
* mode()
* std()
* min()
* max()
* abs()
* prod()-product of values
* cumsum()-Cumulative Sum
* cumprod()-Cumulative Product

In [505]:
data = {
    'name' : pd.Series(['Arslan','Danish','Asher','Babar']),
    'age'  : pd.Series([23,22,22,21]),
    'cgpa' : pd.Series([3.42,2.53,3.01,2.93])
}
df = pd.DataFrame(data)

### sum()

In [506]:
# sum columns (axis=0)
sum_of_columns = df.sum(0)
sum_of_columns

name    ArslanDanishAsherBabar
age                         88
cgpa                     11.89
dtype: object

In [507]:
# sum of rows (axis=1)
sum_of_rows = df.sum(1)
sum_of_rows

0    26.42
1    24.53
2    25.01
3    23.93
dtype: float64

### mean() - applied only on numerical columns

In [508]:
# mean of columns (axis=0)
mean_of_columns = df.mean(0)
mean_of_columns

age     22.0000
cgpa     2.9725
dtype: float64

In [509]:
# mean of rows (axis=1)
mean_of_rows = df.mean(1)
mean_of_rows

0    13.210
1    12.265
2    12.505
3    11.965
dtype: float64

### Summarizing Data (Apply major statistical functions on data)

In [510]:
# summary of numerical columns
summary_of_numerical_columns = df.describe()
summary_of_numerical_columns

             age      cgpa
count   4.000000  4.000000
mean   22.000000  2.972500
std     0.816497  0.364817
min    21.000000  2.530000
25%    21.750000  2.830000
50%    22.000000  2.970000
75%    22.250000  3.112500
max    23.000000  3.420000

In [511]:
# Summary of string columns
summary_of_string_columns = df.describe(include=['object'])
summary_of_string_columns

         name
count       4
unique      4
top     Asher
freq        1

In [512]:
# Summary of all columns
summary_of_all_columns = df.describe(include = 'all')
summary_of_all_columns

         name        age      cgpa
count       4   4.000000  4.000000
unique      4        NaN       NaN
top     Asher        NaN       NaN
freq        1        NaN       NaN
mean      NaN  22.000000  2.972500
std       NaN   0.816497  0.364817
min       NaN  21.000000  2.530000
25%       NaN  21.750000  2.830000
50%       NaN  22.000000  2.970000
75%       NaN  22.250000  3.112500
max       NaN  23.000000  3.420000

# Sorting Data Frame

In [513]:
data = {
    'h': [2, 3, 6, 8, 1, 2],
    'a': [23, 22, 21, 22, 23, 27],
    'c': ['Waqar', 'Fasi', 'Ghulam Haider', 'Arslan', 'Ali Hassan', 'Mustafa'],
    'b': [3.42, 2.53, 2.93, 3.01, 2.7, 6.7],
    'e': [5, 6, 7, 1, 2, 0],
    'g': [89, 34, 56, 90, 12, 67],
    'f': [100, 200, 900, 500, 700, 6500],
    'd': ['G', 'A', 'C', 'E', 'H', 'F']
}

In [514]:
df = pd.DataFrame(data, index=[5, 6, 1, 4, 3, 2])

### Sorting DataFrame by rows indexes

In [515]:
# Ascending order
df_sorted_rows_ascending = df.sort_index()
df_sorted_rows_ascending

   h   a              c     b  e   g     f  d
1  6  21  Ghulam Haider  2.93  7  56   900  C
2  2  27        Mustafa  6.70  0  67  6500  F
3  1  23     Ali Hassan  2.70  2  12   700  H
4  8  22         Arslan  3.01  1  90   500  E
5  2  23          Waqar  3.42  5  89   100  G
6  3  22           Fasi  2.53  6  34   200  A

In [516]:
# Descending order
df_sorted_rows_descending = df.sort_index(ascending=False)
df_sorted_rows_descending

   h   a              c     b  e   g     f  d
6  3  22           Fasi  2.53  6  34   200  A
5  2  23          Waqar  3.42  5  89   100  G
4  8  22         Arslan  3.01  1  90   500  E
3  1  23     Ali Hassan  2.70  2  12   700  H
2  2  27        Mustafa  6.70  0  67  6500  F
1  6  21  Ghulam Haider  2.93  7  56   900  C

### Sorting DataFrame  by column labels

In [517]:
# Ascending order
df_sorted_columns_ascending = df.sort_index(axis=1)
df_sorted_columns_ascending

    a     b              c  d  e     f   g  h
5  23  3.42          Waqar  G  5   100  89  2
6  22  2.53           Fasi  A  6   200  34  3
1  21  2.93  Ghulam Haider  C  7   900  56  6
4  22  3.01         Arslan  E  1   500  90  8
3  23  2.70     Ali Hassan  H  2   700  12  1
2  27  6.70        Mustafa  F  0  6500  67  2

In [518]:
# Descending order
df_sorted_columns_descending = df.sort_index(axis=1, ascending=False)
df_sorted_columns_descending

   h   g     f  e  d              c     b   a
5  2  89   100  5  G          Waqar  3.42  23
6  3  34   200  6  A           Fasi  2.53  22
1  6  56   900  7  C  Ghulam Haider  2.93  21
4  8  90   500  1  E         Arslan  3.01  22
3  1  12   700  2  H     Ali Hassan  2.70  23
2  2  67  6500  0  F        Mustafa  6.70  27

### Sorting DataFrame column values

In [519]:
# Ascending order
df_sorted_column_ascending = df.sort_values(by='a')  # other columns and indexes are sorted accordingly
df_sorted_column_ascending

   h   a              c     b  e   g     f  d
1  6  21  Ghulam Haider  2.93  7  56   900  C
6  3  22           Fasi  2.53  6  34   200  A
4  8  22         Arslan  3.01  1  90   500  E
5  2  23          Waqar  3.42  5  89   100  G
3  1  23     Ali Hassan  2.70  2  12   700  H
2  2  27        Mustafa  6.70  0  67  6500  F

In [520]:
# Single Column (Descending order)
df_sorted_column_descending = df.sort_values(by='a', ascending=False)
df_sorted_column_descending

   h   a              c     b  e   g     f  d
2  2  27        Mustafa  6.70  0  67  6500  F
5  2  23          Waqar  3.42  5  89   100  G
3  1  23     Ali Hassan  2.70  2  12   700  H
6  3  22           Fasi  2.53  6  34   200  A
4  8  22         Arslan  3.01  1  90   500  E
1  6  21  Ghulam Haider  2.93  7  56   900  C

### Sorting DataFrame column values using specific algorithm

In [521]:
# Available algos => mergesot, heapsort, quicksort
df_sorted_column_mergesort = df.sort_values(by='h', kind='mergesort')
df_sorted_column_mergesort

   h   a              c     b  e   g     f  d
3  1  23     Ali Hassan  2.70  2  12   700  H
5  2  23          Waqar  3.42  5  89   100  G
2  2  27        Mustafa  6.70  0  67  6500  F
6  3  22           Fasi  2.53  6  34   200  A
1  6  21  Ghulam Haider  2.93  7  56   900  C
4  8  22         Arslan  3.01  1  90   500  E

# Missing Data
__If we apply calculations on DataFrame without removing NaN values then NaN will be treated as 0__

In [523]:
data = {
    'col1': [1, 2, 3, np.nan, 4, 5, np.nan, 8],
    'col2': [23, np.nan, 21, np.nan, 34, 32, np.nan, 34 ],
    'col3': [6, 7, 8, 9, 0, 12, 12, 34],
    'col4': [3.42, 2.53, 2.93, np.nan, 2.7, 23.5, np.nan, np.nan],
    'col5': [2, 2, 2, 2, 2, 2, 2, 2],
    'col6': [12, np.nan, np.nan, 23, 34, 34, np.nan, 57],
    'col7': [67, 68, 69, 70, 71, 72, 12, 13]
}
df = pd.DataFrame(data)

In [524]:
# Check missing data is available or not
df.isnull()

    col1   col2   col3   col4   col5   col6   col7
0  False  False  False  False  False  False  False
1  False   True  False  False  False   True  False
2  False  False  False  False  False   True  False
3   True   True  False   True  False  False  False
4  False  False  False  False  False  False  False
5  False  False  False  False  False  False  False
6   True   True  False   True  False   True  False
7  False  False  False   True  False  False  False

### Removing Missing Data (NaN)

In [525]:
# Removing rows containing a missing value
df_rows = df.dropna()
df_rows

   col1  col2  col3   col4  col5  col6  col7
0   1.0  23.0     6   3.42     2  12.0    67
4   4.0  34.0     0   2.70     2  34.0    71
5   5.0  32.0    12  23.50     2  34.0    72

In [526]:
# Removing columns containing a missing value
df_columns = df.dropna(axis=1)
df_columns

   col3  col5  col7
0     6     2    67
1     7     2    68
2     8     2    69
3     9     2    70
4     0     2    71
5    12     2    72
6    12     2    12
7    34     2    13

### Filling Missing Data (NaN)

In [529]:
# Forward Filling (NaN values = non NaN value before NaN values)
df_forward = df.fillna(method = 'pad')
df_forward

   col1  col2  col3   col4  col5  col6  col7
0   1.0  23.0     6   3.42     2  12.0    67
1   2.0  23.0     7   2.53     2  12.0    68
2   3.0  21.0     8   2.93     2  12.0    69
3   3.0  21.0     9   2.93     2  23.0    70
4   4.0  34.0     0   2.70     2  34.0    71
5   5.0  32.0    12  23.50     2  34.0    72
6   5.0  32.0    12  23.50     2  34.0    12
7   8.0  34.0    34  23.50     2  57.0    13

In [530]:
# Backward Filling (NaN values = non NaN value after NaN values)
df_backward = df.fillna(method = 'backfill') 
df_backward

   col1  col2  col3   col4  col5  col6  col7
0   1.0  23.0     6   3.42     2  12.0    67
1   2.0  21.0     7   2.53     2  23.0    68
2   3.0  21.0     8   2.93     2  23.0    69
3   4.0  34.0     9   2.70     2  23.0    70
4   4.0  34.0     0   2.70     2  34.0    71
5   5.0  32.0    12  23.50     2  34.0    72
6   8.0  34.0    12    NaN     2  57.0    12
7   8.0  34.0    34    NaN     2  57.0    13

### Replace NaN Values with scalar value

In [531]:
df_scalar_0 = df.fillna(0)
df_scalar_0

   col1  col2  col3   col4  col5  col6  col7
0   1.0  23.0     6   3.42     2  12.0    67
1   2.0   0.0     7   2.53     2   0.0    68
2   3.0  21.0     8   2.93     2   0.0    69
3   0.0   0.0     9   0.00     2  23.0    70
4   4.0  34.0     0   2.70     2  34.0    71
5   5.0  32.0    12  23.50     2  34.0    72
6   0.0   0.0    12   0.00     2   0.0    12
7   8.0  34.0    34   0.00     2  57.0    13

In [532]:
df_scalar_100 = df.fillna(100)
df_scalar_100

    col1   col2  col3    col4  col5   col6  col7
0    1.0   23.0     6    3.42     2   12.0    67
1    2.0  100.0     7    2.53     2  100.0    68
2    3.0   21.0     8    2.93     2  100.0    69
3  100.0  100.0     9  100.00     2   23.0    70
4    4.0   34.0     0    2.70     2   34.0    71
5    5.0   32.0    12   23.50     2   34.0    72
6  100.0  100.0    12  100.00     2  100.0    12
7    8.0   34.0    34  100.00     2   57.0    13

### Replace a generic value

In [533]:
df_replace = df.replace({34 : 344})
df_replace

   col1   col2  col3   col4  col5   col6  col7
0   1.0   23.0     6   3.42     2   12.0    67
1   2.0    NaN     7   2.53     2    NaN    68
2   3.0   21.0     8   2.93     2    NaN    69
3   NaN    NaN     9    NaN     2   23.0    70
4   4.0  344.0     0   2.70     2  344.0    71
5   5.0   32.0    12  23.50     2  344.0    72
6   NaN    NaN    12    NaN     2    NaN    12
7   8.0  344.0   344    NaN     2   57.0    13

# Making Groups of Data Frame

In [534]:
data = {
    'year': [2001, 2001, 2002, 2002, 2003, 2005, 2007, 2007],
    'month': ['March', 'July', 'May', 'Feb', 'June', 'Dec', 'Jan', 'April'],
    'avg_temp': [20, 42, 34, 22, 50, 19, 5, 29]
}
df = pd.DataFrame(data)

### Make groups of dataset by column

In [536]:
groups = df.groupby('year')

### Iterating through groups

In [537]:
for group_name, group_content in groups:
    print(group_name)
    print(group_content)
    print("\n")

2001
   year  month  avg_temp
0  2001  March        20
1  2001   July        42


2002
   year month  avg_temp
2  2002   May        34
3  2002   Feb        22


2003
   year month  avg_temp
4  2003  June        50


2005
   year month  avg_temp
5  2005   Dec        19


2007
   year  month  avg_temp
6  2007    Jan         5
7  2007  April        29

### Select a particular group

In [538]:
group = groups.get_group(2002)
group

   year month  avg_temp
2  2002   May        34
3  2002   Feb        22

### Apply aggregate functions on groups

In [539]:
# size() function => used to find size of each group
size_of_groups = groups.agg(np.size)
size_of_groups

      month  avg_temp
year
2001      2         2
2002      2         2
2003      1         1
2005      1         1
2007      2         2

In [540]:
# mean() function => used to find mean of numerical columns of each group
mean_of_groups = groups.agg(np.mean)
mean_of_groups

      avg_temp
year
2001        31
2002        28
2003        50
2005        19
2007        17

### Apply multiple aggregate functions on groups at once

In [541]:
agg_functions_on_groups = groups.agg([np.mean, np.sum, np.std])
agg_functions_on_groups

     avg_temp
         mean sum        std
year
2001       31  62  15.556349
2002       28  56   8.485281
2003       50  50        NaN
2005       19  19        NaN
2007       17  34  16.970563

###  Filtration

In [543]:
# select groups having rows >=2
sized_groups = groups.filter(lambda x: x['avg_temp'].size > 1)
sized_groups

   year  month  avg_temp
0  2001  March        20
1  2001   July        42
2  2002    May        34
3  2002    Feb        22
6  2007    Jan         5
7  2007  April        29

### Transformations

In [544]:
# transforming average temperature column (adding 2 degree in all temperatures)
transformed_function = lambda x: x + 2
transformed_temp_column = groups.transform(transformed_function)
transformed_temp_column

   avg_temp
0        22
1        44
2        36
3        24
4        52
5        21
6         7
7        31

# Joining / Merging Data Frames

In [545]:
data1 = {
     'id': ['stu1', 'stu2', 'stu3', 'stu4'],
     'name'    : ['Arslan', 'Danish', 'Babar', 'Asher'],
     'subject' : ['sub1', 'sub2', 'sub3', 'sub2']
}

data2 = {
    'id': ['stu1', 'stu2', 'stu3', 'stu4'],
    'name': ['Waleed', 'Fasi', 'Zaheer', 'Muneeb'],
    'subject': ['sub4', 'sub5', 'sub3', 'sub2']  
}

In [546]:
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

### Merge DataFrames on a key (id) => Select those students only whose ids are same

In [547]:
df = pd.merge(df1, df2, on='id')
df

     id  name_x subject_x  name_y subject_y
0  stu1  Arslan      sub1  Waleed      sub4
1  stu2  Danish      sub2    Fasi      sub5
2  stu3   Babar      sub3  Zaheer      sub3
3  stu4   Asher      sub2  Muneeb      sub2

### Merge DataFrames on multiple keys (id, Subject) => Select those students only whose ids and subjects both are same

In [549]:
df = pd.merge(df1, df2, on=['id', 'subject'])
df

     id name_x subject  name_y
0  stu3  Babar    sub3  Zaheer
1  stu4  Asher    sub2  Muneeb

### Left join DataFrames

In [553]:
left_join_df = pd.merge(df1, df2, on='subject', how='left')  # df1=Left DataFrame, df2=Right DataFrame
left_join_df

   id_x  name_x subject  id_y  name_y
0  stu1  Arslan    sub1   NaN     NaN
1  stu2  Danish    sub2  stu4  Muneeb
2  stu3   Babar    sub3  stu3  Zaheer
3  stu4   Asher    sub2  stu4  Muneeb

### Right join DataFrames

In [555]:
right_join_df = pd.merge(df1, df2, on='subject', how='right')
right_join_df

   id_x  name_x subject  id_y  name_y
0  stu2  Danish    sub2  stu4  Muneeb
1  stu4   Asher    sub2  stu4  Muneeb
2  stu3   Babar    sub3  stu3  Zaheer
3   NaN     NaN    sub4  stu1  Waleed
4   NaN     NaN    sub5  stu2    Fasi

### Full outer join

In [557]:
full_join_df = pd.merge(df1, df2, on='subject', how='outer')
full_join_df

   id_x  name_x subject  id_y  name_y
0  stu1  Arslan    sub1   NaN     NaN
1  stu2  Danish    sub2  stu4  Muneeb
2  stu4   Asher    sub2  stu4  Muneeb
3  stu3   Babar    sub3  stu3  Zaheer
4   NaN     NaN    sub4  stu1  Waleed
5   NaN     NaN    sub5  stu2    Fasi

### Inner Join

In [559]:
inner_join_df = pd.merge(df1, df2, on='subject', how='inner')
inner_join_df

   id_x  name_x subject  id_y  name_y
0  stu2  Danish    sub2  stu4  Muneeb
1  stu4   Asher    sub2  stu4  Muneeb
2  stu3   Babar    sub3  stu3  Zaheer

# Concatenate Data Frames

In [560]:
data1 = {
    'id': ['stu1', 'stu2', 'stu3', 'stu4'],
    'name': ['Arslan', 'Danish', 'Babar', 'Asher'],
    'subject': ['sub1', 'sub2', 'sub3', 'sub2']
}

data2 = {
    'id': ['stu1', 'stu2', 'stu3', 'stu4'],
    'name': ['Waleed', 'Fasi', 'Zaheer', 'Muneeb'],
    'subject': ['sub4', 'sub5', 'sub3', 'sub2']  
}

In [561]:
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

### Concatenate DataFrames with their own indexes

In [562]:
df = pd.concat([df1, df2])
df

     id    name subject
0  stu1  Arslan    sub1
1  stu2  Danish    sub2
2  stu3   Babar    sub3
3  stu4   Asher    sub2
0  stu1  Waleed    sub4
1  stu2    Fasi    sub5
2  stu3  Zaheer    sub3
3  stu4  Muneeb    sub2

### Concatenate DataFrames with their own indexes but different keys

In [563]:
df = pd.concat([df1,df2], keys=['df1_key', 'df2_key'])
df

             id    name subject
df1_key 0  stu1  Arslan    sub1
        1  stu2  Danish    sub2
        2  stu3   Babar    sub3
        3  stu4   Asher    sub2
df2_key 0  stu1  Waleed    sub4
        1  stu2    Fasi    sub5
        2  stu3  Zaheer    sub3
        3  stu4  Muneeb    sub2

### Concatenate DataFrames with new indexes

In [564]:
df = pd.concat([df1, df2], ignore_index=True)
df

     id    name subject
0  stu1  Arslan    sub1
1  stu2  Danish    sub2
2  stu3   Babar    sub3
3  stu4   Asher    sub2
4  stu1  Waleed    sub4
5  stu2    Fasi    sub5
6  stu3  Zaheer    sub3
7  stu4  Muneeb    sub2

### Concatenate columns of DataFrames (axis=1)

In [565]:
df = pd.concat([df1, df2], axis=1)
df

     id    name subject    id    name subject
0  stu1  Arslan    sub1  stu1  Waleed    sub4
1  stu2  Danish    sub2  stu2    Fasi    sub5
2  stu3   Babar    sub3  stu3  Zaheer    sub3
3  stu4   Asher    sub2  stu4  Muneeb    sub2

### Concatenate DataFrames using append() function

In [566]:
df = df1.append(df2, ignore_index=True)
df

     id    name subject
0  stu1  Arslan    sub1
1  stu2  Danish    sub2
2  stu3   Babar    sub3
3  stu4   Asher    sub2
4  stu1  Waleed    sub4
5  stu2    Fasi    sub5
6  stu3  Zaheer    sub3
7  stu4  Muneeb    sub2

# Time Stamps
A timestamp is the current time of an event that is recorded by a computer<br>
__Example:__<br>
Timestamps on files that require backups are essential so that the backup mechanism can know the difference between
the file on backup and the current file, whether it has been changed or not as referenced by the date-modified timestamp

In [568]:
from datetime import datetime

### Get current date & time (Computer date & time) - timestamp

In [569]:
current_datetime_timestamp = datetime.now()
current_datetime_timestamp

datetime.datetime(2020, 5, 10, 0, 27, 12, 605489)

### Create a timestamp

In [571]:
timestamp = pd.Timestamp('30-01-2019')
timestamp

Timestamp('2019-01-30 00:00:00')

In [572]:
timestamp = pd.Timestamp('30-01-2019 9:11PM')
timestamp

Timestamp('2019-01-30 21:11:00')

In [573]:
timestamp = pd.Timestamp('9:11PM')
timestamp

Timestamp('2020-05-10 21:11:00')

### Create a range of time

In [574]:
# 30-min range
time_range = pd.date_range('2:00', '8:00', freq='30min').time
time_range

array([datetime.time(2, 0), datetime.time(2, 30), datetime.time(3, 0),
       datetime.time(3, 30), datetime.time(4, 0), datetime.time(4, 30),
       datetime.time(5, 0), datetime.time(5, 30), datetime.time(6, 0),
       datetime.time(6, 30), datetime.time(7, 0), datetime.time(7, 30),
       datetime.time(8, 0)], dtype=object)

In [575]:
# 1 hour range
time_range = pd.date_range('2:00', '8:00', freq='H').time
time_range

array([datetime.time(2, 0), datetime.time(3, 0), datetime.time(4, 0),
       datetime.time(5, 0), datetime.time(6, 0), datetime.time(7, 0),
       datetime.time(8, 0)], dtype=object)

### Convert Series into timestamp (None = Nat => not a time)

In [576]:
s = pd.Series(['30-01-2019', '9:23PM', '30-01-2019 9:23PM', None])
s

0           30-01-2019
1               9:23PM
2    30-01-2019 9:23PM
3                 None
dtype: object

In [577]:
s_timestamp = pd.to_datetime(s)
s_timestamp

0   2019-01-30 00:00:00
1   2020-05-10 21:23:00
2   2019-01-30 21:23:00
3                   NaT
dtype: datetime64[ns]

# Date Data
* __By default frequency of date_range() is days__
* __We can change frequency to generate different ranges of dates__
  __freq='M' :: dates on months basis__
  __fres='W' :: dates on weekly basis__
  __and so on....__

### Create range of dates on days basis

In [579]:
dates_days = pd.date_range('01/01/2019', periods=10)  # periods => no of dates

In [580]:
# Range of dates on days basis
dates_days

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06', '2019-01-07', '2019-01-08',
               '2019-01-09', '2019-01-10'],
              dtype='datetime64[ns]', freq='D')

In [581]:
# Single Data
dates_days[2]

Timestamp('2019-01-03 00:00:00', freq='D')

### Create range of dates on months basis

In [582]:
dates_months = pd.date_range('01/01/2019', periods=10, freq='M')

DatetimeIndex(['2019-01-31', '2019-02-28', '2019-03-31', '2019-04-30',
               '2019-05-31', '2019-06-30', '2019-07-31', '2019-08-31',
               '2019-09-30', '2019-10-31'],
              dtype='datetime64[ns]', freq='M')

In [583]:
# Range of dates on months basis
dates_months

DatetimeIndex(['2019-01-31', '2019-02-28', '2019-03-31', '2019-04-30',
               '2019-05-31', '2019-06-30', '2019-07-31', '2019-08-31',
               '2019-09-30', '2019-10-31'],
              dtype='datetime64[ns]', freq='M')

In [584]:
# Single data
dates_months[4]

Timestamp('2019-05-31 00:00:00', freq='M')

### Create range of business dates (excluding saturday and sunday)

In [585]:
bdates_days = pd.bdate_range('01/02/2019', periods=20)

In [586]:
# Range of business dates (excluding saturday and sunday)
bdates_days

DatetimeIndex(['2019-01-02', '2019-01-03', '2019-01-04', '2019-01-07',
               '2019-01-08', '2019-01-09', '2019-01-10', '2019-01-11',
               '2019-01-14', '2019-01-15', '2019-01-16', '2019-01-17',
               '2019-01-18', '2019-01-21', '2019-01-22', '2019-01-23',
               '2019-01-24', '2019-01-25', '2019-01-28', '2019-01-29'],
              dtype='datetime64[ns]', freq='B')

In [588]:
# Single Date
bdates_days[7]

Timestamp('2019-01-11 00:00:00', freq='B')